{"format": "graph-model", "generatedBy": "2.10.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "404"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/dense_model/dense_5/ReadVariableOp_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/ReadVariableOp_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/ReadVariableOp_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/dense_model/normalization/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "404"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "404"}]}}}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "404"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "404"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/normalization/sub", "op": "Sub", "input": ["input_1", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/normalization/sub", "ConstantFolding/StatefulPartitionedCall/dense_model/normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/normalization/truediv", "StatefulPartitionedCall/dense_model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense/add/x", "StatefulPartitionedCall/dense_model/dense/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense/truediv", "StatefulPartitionedCall/dense_model/dense/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense/add_1", "StatefulPartitionedCall/dense_model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense/Mul_2", "StatefulPartitionedCall/dense_model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_1/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense_1/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_1/add/x", "StatefulPartitionedCall/dense_model/dense_1/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_1/truediv", "StatefulPartitionedCall/dense_model/dense_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_1/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense_1/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_1/add_1", "StatefulPartitionedCall/dense_model/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense_1/Mul_2", "StatefulPartitionedCall/dense_model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_2/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense_2/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense_2/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_2/add/x", "StatefulPartitionedCall/dense_model/dense_2/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_2/truediv", "StatefulPartitionedCall/dense_model/dense_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_2/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense_2/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_2/add_1", "StatefulPartitionedCall/dense_model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense_2/Mul_2", "StatefulPartitionedCall/dense_model/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_3/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense_3/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense_3/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_3/add/x", "StatefulPartitionedCall/dense_model/dense_3/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_3/truediv", "StatefulPartitionedCall/dense_model/dense_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_3/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense_3/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_3/add_1", "StatefulPartitionedCall/dense_model/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense_3/Mul_2", "StatefulPartitionedCall/dense_model/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_4/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense_4/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense_4/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_4/add/x", "StatefulPartitionedCall/dense_model/dense_4/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense_4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_4/truediv", "StatefulPartitionedCall/dense_model/dense_4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_4/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense_4/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_4/add_1", "StatefulPartitionedCall/dense_model/dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense_4/Mul_2", "StatefulPartitionedCall/dense_model/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_5/Mul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/dense_model/dense_5/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/dense_model/dense_5/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_5/add/x", "StatefulPartitionedCall/dense_model/dense_5/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/truediv", "op": "Reciprocal", "input": ["StatefulPartitionedCall/dense_model/dense_5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_5/truediv", "StatefulPartitionedCall/dense_model/dense_5/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/dense_5/ReadVariableOp_1", "StatefulPartitionedCall/dense_model/dense_5/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_5/add_1", "StatefulPartitionedCall/dense_model/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/dense_6/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model/dense_5/Mul_2", "StatefulPartitionedCall/dense_model/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_model/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/dense_model/unnormalise_output_layer/mul", "op": "Mul", "input": ["StatefulPartitionedCall/dense_model/dense_6/BiasAdd", "unknown_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model/unnormalise_output_layer/add", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_model/unnormalise_output_layer/mul", "unknown_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/dense_model/unnormalise_output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/dense_model/dense_5/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_5/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_5/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_5/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/ReadVariableOp_1", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/Mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown", "shape": [1, 6], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/dense_model/normalization/truediv_recip", "shape": [1, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/MatMul/ReadVariableOp", "shape": [6, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_4/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_5/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_5/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_6/MatMul/ReadVariableOp", "shape": [512, 404], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model/dense_6/BiasAdd/ReadVariableOp", "shape": [404], "dtype": "float32"}, {"name": "unknown_27", "shape": [404], "dtype": "float32"}, {"name": "unknown_28", "shape": [404], "dtype": "float32"}]}]}